henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
        <register>
          <name>ETH_MACTSCR</name>
          <displayName>ETH_MACTSCR</displayName>
          <description>This register controls the operation of the
          System Time generator and processing of PTP packets for
          timestamping in the Receiver.</description>
          <addressOffset>0xB00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>TSENA</name>
              <description>TSENA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCFUPDT</name>
              <description>TSCFUPDT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSINIT</name>
              <description>TSINIT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUPDT</name>
              <description>TSUPDT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSADDREG</name>
              <description>TSADDREG</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENALL</name>
              <description>TSENALL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSCTRLSSR</name>
              <description>TSCTRLSSR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSVER2ENA</name>
              <description>TSVER2ENA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPENA</name>
              <description>TSIPENA</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPV6ENA</name>
              <description>TSIPV6ENA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIPV4ENA</name>
              <description>TSIPV4ENA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEVNTENA</name>
              <description>TSEVNTENA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSMSTRENA</name>
              <description>TSMSTRENA</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAPTYPSEL</name>
              <description>SNAPTYPSEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENMACADDR</name>
              <description>TSENMACADDR</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSC</name>
              <description>CSC</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTSSTSM</name>
              <description>TXTSSTSM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AV8021ASMEN</name>
              <description>AV8021ASMEN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACSSIR</name>
          <displayName>ETH_MACSSIR</displayName>
          <description>The Sub-second Increment register is present
          only when the IEEE 1588 timestamp feature is selected
          without an external timestamp input. In Coarse Update
          mode [Bit 1 in ETH_MACTSCR register, the value in this
          register is added to the system time every clock cycle of
          HCLK. In Fine Update mode, the value in this register is
          added to the system time whenever the Accumulator gets an
          overflow.</description>
          <addressOffset>0xB04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SNSINC</name>
              <description>SNSINC</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSINC</name>
              <description>SSINC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACSTSR</name>
          <displayName>ETH_MACSTSR</displayName>
          <description>The System Time Seconds register, along with
          System Time Nanoseconds register, indicates the current
          value of the system time maintained by the MAC. Though it
          is updated on a continuous basis, there is some delay
          from the actual time because of clock domain transfer
          latencies (from HCLK to CSR clock). This register is
          present only when the IEEE 1588 Timestamp feature is
          selected without external timestamp input.</description>
          <addressOffset>0xB08</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSS</name>
              <description>TSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACSTNR</name>
          <displayName>ETH_MACSTNR</displayName>
          <description>The System Time Nanoseconds register, along
          with System Time Seconds register, indicates the current
          value of the system time maintained by the MAC. This
          register is present only when the IEEE 1588 Timestamp
          feature is selected without external timestamp
          input.</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSS</name>
              <description>TSSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACSTSUR</name>
          <displayName>ETH_MACSTSUR</displayName>
          <description>The System Time Seconds Update register,
          along with the System Time Nanoseconds Update register,
          initializes or updates the system time maintained by the
          MAC. You must write both registers before setting the
          TSINIT or TSUPDT bits in ETH_MACTSCR register. This
          register is present only when the IEEE 1588 Timestamp
          feature is selected without external timestamp
          input.</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSS</name>
              <description>TSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACSTNUR</name>
          <displayName>ETH_MACSTNUR</displayName>
          <description>This register is present only when the IEEE
          1588 timestamp feature is selected without external
          timestamp input.</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSS</name>
              <description>TSSS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>ADDSUB</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSAR</name>
          <displayName>ETH_MACTSAR</displayName>
          <description>The Timestamp Addend register is present
          only when the IEEE 1588 Timestamp feature is selected
          without external timestamp input. This register value is
          used only when the system time is configured for Fine
          Update mode (TSCFUPDT bit in the ETH_MACTSCR register).
          The content of this register is added to a 32-bit
          accumulator in every clock cycle (of HCLK) and the system
          time is updated whenever the accumulator
          overflows.</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSAR</name>
              <description>TSAR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSSR</name>
          <displayName>ETH_MACTSSR</displayName>
          <description>The Timestamp Status register is present
          only when the IEEE 1588 Timestamp feature is selected.
          All bits except Bits[27:25] gets cleared when the
          application reads this register.</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSSOVF</name>
              <description>TSSOVF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTARGT0</name>
              <description>TSTARGT0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUXTSTRIG</name>
              <description>AUXTSTRIG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTRGTERR0</name>
              <description>TSTRGTERR0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTSSIS</name>
              <description>TXTSSIS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATSSTN</name>
              <description>ATSSTN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATSSTM</name>
              <description>ATSSTM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATSNS</name>
              <description>ATSNS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTxTSSNR</name>
          <displayName>ETH_MACTxTSSNR</displayName>
          <description>This register contains the nanosecond part
          of timestamp captured for Transmit packets when Tx status
          is disabled.</description>
          <addressOffset>0xB30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXTSSLO</name>
              <description>TXTSSLO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXTSSMIS</name>
              <description>TXTSSMIS</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTxTSSSR</name>
          <displayName>ETH_MACTxTSSSR</displayName>
          <description>The register contains the higher 32 bits of
          the timestamp (in seconds) captured when a PTP packet is
          transmitted.</description>
          <addressOffset>0xB34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TXTSSHI</name>
              <description>TXTSSHI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACACR</name>
          <displayName>ETH_MACACR</displayName>
          <description>The Auxiliary Timestamp Control register
          controls the Auxiliary Timestamp snapshot.</description>
          <addressOffset>0xB40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ATSFC</name>
              <description>ATSFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN0</name>
              <description>ATSEN0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN1</name>
              <description>ATSEN1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN2</name>
              <description>ATSEN2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSEN3</name>
              <description>ATSEN3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACATSNR</name>
          <displayName>ETH_MACATSNR</displayName>
          <description>The Auxiliary Timestamp Nanoseconds
          register, along with ETH_MACATSSR, gives the 64-bit
          timestamp stored as auxiliary snapshot. These two
          registers form the read port of a 64-bit wide FIFO with a
          depth of 4 words. You can store multiple snapshots in
          this FIFO. Bits[29:25] in ETH_MACTSSR indicate the
          fill-level of the FIFO. The top of the FIFO is removed
          only when the last byte of MAC Register 91 (Auxiliary
          Timestamp - Seconds Register) is read. In the
          little-endian mode, this means when Bits[31:24] are read
          and in big-endian mode, Bits[7:0] are read.</description>
          <addressOffset>0xB48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXTSLO</name>
              <description>AUXTSLO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACATSSR</name>
          <displayName>ETH_MACATSSR</displayName>
          <description>The Auxiliary Timestamp - Seconds register
          contains the lower 32 bits of the Seconds field of the
          auxiliary timestamp register.</description>
          <addressOffset>0xB4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXTSHI</name>
              <description>AUXTSHI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSIACR</name>
          <displayName>ETH_MACTSIACR</displayName>
          <description>The MAC Timestamp Ingress Asymmetry
          Correction register contains the Ingress Asymmetry
          Correction value to be used while updating correction
          field in PDelay_Resp PTP messages.</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSTIAC</name>
              <description>OSTIAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSEACR</name>
          <displayName>ETH_MACTSEACR</displayName>
          <description>The MAC Timestamp Egress Asymmetry
          Correction register contains the Egress Asymmetry
          Correction value to be used while updating the correction
          field in PDelay_Req PTP messages.</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSTEAC</name>
              <description>OSTEAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSICNR</name>
          <displayName>ETH_MACTSICNR</displayName>
          <description>This register contains the correction value
          in nanoseconds to be used with the captured timestamp
          value in the ingress path.</description>
          <addressOffset>0xB58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSIC</name>
              <description>TSIC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACTSECNR</name>
          <displayName>ETH_MACTSECNR</displayName>
          <description>This register contains the correction value
          in nanoseconds to be used with the captured timestamp
          value in the egress path.</description>
          <addressOffset>0xB5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSEC</name>
              <description>TSEC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETH_MACPPSCR</name>
          <displayName>ETH_MACPPSCR</displayName>
          <description>The PPS Control register is present only
          when the Timestamp feature is selected and External
          Timestamp is not enabled. Bits[30:24] of this register
          are valid only when four Flexible PPS outputs are
          selected. Bits[22:16] are valid only when three or more
          Flexible PPS outputs are selected. Bits[14:8] are valid
          only when two or more Flexible PPS outputs are selected.
          Bits[6:4] are valid only when Flexible PPS feature is
          selected.</description>
          <addressOffset>0xB70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PPSCTRL</name>
              <description>PPSCTRL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PPSEN0</name>
              <description>PPSEN0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGTMODSEL0</name>
              <description>TRGTMODSEL0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
