henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
        <register>
          <name>EXTI_HWCFGR8</name>
          <displayName>EXTI_HWCFGR8</displayName>
          <description>EXTI hardware configuration register 8</description>
          <addressOffset>0x3D4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>EXTI_HWCFGR7</name>
          <displayName>EXTI_HWCFGR7</displayName>
          <description>EXTI hardware configuration register 7</description>
          <addressOffset>0x3D8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000EFFFF</resetValue>
          <fields>
            <field>
              <name>CPUEVENT</name>
              <description>CPUEVENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR6</name>
          <displayName>EXTI_HWCFGR6</displayName>
          <description>EXTI hardware configuration register 6</description>
          <addressOffset>0x3DC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000EFFFF</resetValue>
          <fields>
            <field>
              <name>CPUEVENT</name>
              <description>CPUEVENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR5</name>
          <displayName>EXTI_HWCFGR5</displayName>
          <description>EXTI hardware configuration register 5</description>
          <addressOffset>0x3E0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000EFFFF</resetValue>
          <fields>
            <field>
              <name>CPUEVENT</name>
              <description>CPUEVENT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR4</name>
          <displayName>EXTI_HWCFGR4</displayName>
          <description>EXTI hardware configuration register 4</description>
          <addressOffset>0x3E4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>EVENT_TRG</name>
              <description>EVENT_TRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR3</name>
          <displayName>EXTI_HWCFGR3</displayName>
          <description>EXTI hardware configuration register 3</description>
          <addressOffset>0x3E8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>EVENT_TRG</name>
              <description>EVENT_TRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR2</name>
          <displayName>EXTI_HWCFGR2</displayName>
          <description>EXTI hardware configuration register 2</description>
          <addressOffset>0x3EC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0001FFFF</resetValue>
          <fields>
            <field>
              <name>EVENT_TRG</name>
              <description>EVENT_TRG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_HWCFGR1</name>
          <displayName>EXTI_HWCFGR1</displayName>
          <description>EXTI hardware configuration register 1</description>
          <addressOffset>0x3F0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000B214B</resetValue>
          <fields>
            <field>
              <name>NBEVENTS</name>
              <description>NBEVENTS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>NBCPUS</name>
              <description>NBCPUS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CPUEVTEN</name>
              <description>CPUEVTEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>NBIOPORT</name>
              <description>NBIOPORT</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_VERR</name>
          <displayName>EXTI_VERR</displayName>
          <description>EXTI IP version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_IPIDR</name>
          <displayName>EXTI_IPIDR</displayName>
          <description>EXTI identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000E0001</resetValue>
          <fields>
            <field>
              <name>IPID</name>
              <description>IPID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTI_SIDR</name>
          <displayName>EXTI_SIDR</displayName>
          <description>EXTI size ID register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
