henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
        <register>
          <name>GICD_IPRIORITYR39</name>
          <displayName>GICD_IPRIORITYR39</displayName>
          <description>GICD interrupt priority register 39</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR40</name>
          <displayName>GICD_IPRIORITYR40</displayName>
          <description>GICD interrupt priority register 40</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR41</name>
          <displayName>GICD_IPRIORITYR41</displayName>
          <description>GICD interrupt priority register 41</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR42</name>
          <displayName>GICD_IPRIORITYR42</displayName>
          <description>GICD interrupt priority register 42</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR43</name>
          <displayName>GICD_IPRIORITYR43</displayName>
          <description>GICD interrupt priority register 43</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR44</name>
          <displayName>GICD_IPRIORITYR44</displayName>
          <description>GICD interrupt priority register 44</description>
          <addressOffset>0x4B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR45</name>
          <displayName>GICD_IPRIORITYR45</displayName>
          <description>GICD interrupt priority register 45</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR46</name>
          <displayName>GICD_IPRIORITYR46</displayName>
          <description>GICD interrupt priority register 46</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR47</name>
          <displayName>GICD_IPRIORITYR47</displayName>
          <description>GICD interrupt priority register 47</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR48</name>
          <displayName>GICD_IPRIORITYR48</displayName>
          <description>GICD interrupt priority register 48</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR49</name>
          <displayName>GICD_IPRIORITYR49</displayName>
          <description>GICD interrupt priority register 49</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR50</name>
          <displayName>GICD_IPRIORITYR50</displayName>
          <description>GICD interrupt priority register 50</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR51</name>
          <displayName>GICD_IPRIORITYR51</displayName>
          <description>GICD interrupt priority register 51</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR52</name>
          <displayName>GICD_IPRIORITYR52</displayName>
          <description>GICD interrupt priority register 52</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR53</name>
          <displayName>GICD_IPRIORITYR53</displayName>
          <description>GICD interrupt priority register 53</description>
          <addressOffset>0x4D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR54</name>
          <displayName>GICD_IPRIORITYR54</displayName>
          <description>GICD interrupt priority register 54</description>
          <addressOffset>0x4D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR55</name>
          <displayName>GICD_IPRIORITYR55</displayName>
          <description>GICD interrupt priority register 55</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR56</name>
          <displayName>GICD_IPRIORITYR56</displayName>
          <description>GICD interrupt priority register 56</description>
          <addressOffset>0x4E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GICD_IPRIORITYR57</name>
          <displayName>GICD_IPRIORITYR57</displayName>
          <description>GICD interrupt priority register 57</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIORITY0</name>
              <description>PRIORITY0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY1</name>
              <description>PRIORITY1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY2</name>
              <description>PRIORITY2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PRIORITY3</name>
              <description>PRIORITY3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
