henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>SYSCFG</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x50020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSCFG_BOOTR</name>
          <displayName>SYSCFG_BOOTR</displayName>
          <description>This register is used to know the state of BOOT pins and to control pull-up to reduce the static power consumption on the pin set to high level. )</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOOT0</name>
              <description>BOOT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT1</name>
              <description>BOOT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT2</name>
              <description>BOOT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOT0_PD</name>
              <description>BOOT0_PD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT1_PD</name>
              <description>BOOT1_PD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOT2_PD</name>
              <description>BOOT2_PD</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_PMCSETR</name>
          <displayName>SYSCFG_PMCSETR</displayName>
          <description>SYSCFG peripheral mode configuration set register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C1_FMP</name>
              <description>I2C1_FMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>I2C2_FMP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_FMP</name>
              <description>I2C3_FMP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4_FMP</name>
              <description>I2C4_FMP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C5_FMP</name>
              <description>I2C5_FMP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6_FMP</name>
              <description>I2C6_FMP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_BOOSTER</name>
              <description>EN_BOOSTER</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANASWVDD</name>
              <description>ANASWVDD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_CLK_SEL</name>
              <description>ETH_CLK_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_REF_CLK_SEL</name>
              <description>ETH_REF_CLK_SEL</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_SELMII</name>
              <description>ETH_SELMII</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_SEL</name>
              <description>ETH_SEL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ANA0_SEL</name>
              <description>ANA0_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANA1_SEL</name>
              <description>ANA1_SEL</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_IOCTRLSETR</name>
          <displayName>SYSCFG_IOCTRLSETR</displayName>
          <description>SYSCFG IO control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSLVEN_TRACE</name>
              <description>HSLVEN_TRACE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_QUADSPI</name>
              <description>HSLVEN_QUADSPI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_ETH</name>
              <description>HSLVEN_ETH</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_SDMMC</name>
              <description>HSLVEN_SDMMC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_SPI</name>
              <description>HSLVEN_SPI</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ICNR</name>
          <displayName>SYSCFG_ICNR</displayName>
          <description>SYSCFG interconnect control register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AXI_M0</name>
              <description>AXI_M0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M1</name>
              <description>AXI_M1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M2</name>
              <description>AXI_M2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M3</name>
              <description>AXI_M3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M5</name>
              <description>AXI_M5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M6</name>
              <description>AXI_M6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M7</name>
              <description>AXI_M7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M8</name>
              <description>AXI_M8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M9</name>
              <description>AXI_M9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXI_M10</name>
              <description>AXI_M10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CMPCR</name>
          <displayName>SYSCFG_CMPCR</displayName>
          <description>SYSCFG compensation cell control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00870000</resetValue>
          <fields>
            <field>
              <name>SW_CTRL</name>
              <description>SW_CTRL</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READY</name>
              <description>READY</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RANSRC</name>
              <description>RANSRC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAPSRC</name>
              <description>RAPSRC</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANSRC</name>
              <description>ANSRC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APSRC</name>
              <description>APSRC</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CMPENSETR</name>
          <displayName>SYSCFG_CMPENSETR</displayName>
          <description>SYSCFG compensation cell enable set register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_EN</name>
              <description>MPU_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCU_EN</name>
              <description>MCU_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CMPENCLRR</name>
          <displayName>SYSCFG_CMPENCLRR</displayName>
          <description>SYSCFG compensation cell enable set register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_EN</name>
              <description>MPU_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCU_EN</name>
              <description>MCU_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CBR</name>
          <displayName>SYSCFG_CBR</displayName>
          <description>SYSCFG control timer break register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLL</name>
              <description>CLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDL</name>
              <description>PVDL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_PMCCLRR</name>
          <displayName>SYSCFG_PMCCLRR</displayName>
          <description>SYSCFG peripheral mode configuration clear register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C1_FMP</name>
              <description>I2C1_FMP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>I2C2_FMP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_FMP</name>
              <description>I2C3_FMP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C4_FMP</name>
              <description>I2C4_FMP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C5_FMP</name>
              <description>I2C5_FMP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C6_FMP</name>
              <description>I2C6_FMP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN_BOOSTER</name>
              <description>EN_BOOSTER</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANASWVDD</name>
              <description>ANASWVDD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_CLK_SEL</name>
              <description>ETH_CLK_SEL</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_REF_CLK_SEL</name>
              <description>ETH_REF_CLK_SEL</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_SELMII</name>
              <description>ETH_SELMII</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH_SEL</name>
              <description>ETH_SEL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ANA0_SEL</name>
              <description>ANA0_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ANA1_SEL</name>
              <description>ANA1_SEL</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_IOCTRLCLRR</name>
          <displayName>SYSCFG_IOCTRLCLRR</displayName>
          <description>SYSCFG IO control register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HSLVEN_TRACE</name>
              <description>HSLVEN_TRACE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_QUADSPI</name>
              <description>HSLVEN_QUADSPI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_ETH</name>
              <description>HSLVEN_ETH</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_SDMMC</name>
              <description>HSLVEN_SDMMC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSLVEN_SPI</name>
              <description>HSLVEN_SPI</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_VERR</name>
          <displayName>SYSCFG_VERR</displayName>
          <description>SYSCFG version register</description>
          <addressOffset>0x3F4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>MINREV</name>
              <description>MINREV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MAJREV</name>
              <description>MAJREV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_IPIDR</name>
          <displayName>SYSCFG_IPIDR</displayName>
          <description>SYSCFG identification register</description>
          <addressOffset>0x3F8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00030001</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <description>ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_SIDR</name>
          <displayName>SYSCFG_SIDR</displayName>
          <description>SYSCFG size identification register</description>
          <addressOffset>0x3FC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0xA3C5DD01</resetValue>
          <fields>
            <field>
              <name>SID</name>
              <description>SID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
