henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
				<register>
					<name>RCC_APB4RSTCLRR</name>
					<displayName>RCC_APB4RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral.</description>
					<addressOffset>0x184</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCRST</name>
							<description>LTDCRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIRST</name>
							<description>DSIRST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMRST</name>
							<description>DDRPERFMRST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYRST</name>
							<description>USBPHYRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB5RSTSETR</name>
					<displayName>RCC_APB5RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x188</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6RST</name>
							<description>SPI6RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4RST</name>
							<description>I2C4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6RST</name>
							<description>I2C6RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1RST</name>
							<description>USART1RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENRST</name>
							<description>STGENRST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB5RSTCLRR</name>
					<displayName>RCC_APB5RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x18C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6RST</name>
							<description>SPI6RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4RST</name>
							<description>I2C4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6RST</name>
							<description>I2C6RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1RST</name>
							<description>USART1RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENRST</name>
							<description>STGENRST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB5RSTSETR</name>
					<displayName>RCC_AHB5RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x190</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOZRST</name>
							<description>GPIOZRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1RST</name>
							<description>CRYP1RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1RST</name>
							<description>HASH1RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1RST</name>
							<description>RNG1RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXIMCRST</name>
							<description>AXIMCRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB5RSTCLRR</name>
					<displayName>RCC_AHB5RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x194</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPIOZRST</name>
							<description>GPIOZRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1RST</name>
							<description>CRYP1RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1RST</name>
							<description>HASH1RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1RST</name>
							<description>RNG1RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXIMCRST</name>
							<description>AXIMCRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB6RSTSETR</name>
					<displayName>RCC_AHB6RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral.</description>
					<addressOffset>0x198</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>GPURST</name>
							<description>GPURST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ETHMACRST</name>
							<description>ETHMACRST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCRST</name>
							<description>FMCRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIRST</name>
							<description>QSPIRST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1RST</name>
							<description>SDMMC1RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2RST</name>
							<description>SDMMC2RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1RST</name>
							<description>CRC1RST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHRST</name>
							<description>USBHRST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB6RSTCLRR</name>
					<displayName>RCC_AHB6RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral.</description>
					<addressOffset>0x19C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ETHMACRST</name>
							<description>ETHMACRST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FMCRST</name>
							<description>FMCRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>QSPIRST</name>
							<description>QSPIRST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC1RST</name>
							<description>SDMMC1RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC2RST</name>
							<description>SDMMC2RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC1RST</name>
							<description>CRC1RST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBHRST</name>
							<description>USBHRST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_TZAHB6RSTSETR</name>
					<displayName>RCC_TZAHB6RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  activates the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x1A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMARST</name>
							<description>MDMARST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_TZAHB6RSTCLRR</name>
					<displayName>RCC_TZAHB6RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  releases the reset of the corresponding peripheral. If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x1A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MDMARST</name>
							<description>MDMARST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB4ENSETR</name>
					<displayName>RCC_MP_APB4ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit of the corresponding peripheral to . It shall be used to allocate a peripheral to the MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x200</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCEN</name>
							<description>LTDCEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIEN</name>
							<description>DSIEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMEN</name>
							<description>DDRPERFMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2APBEN</name>
							<description>IWDG2APBEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYEN</name>
							<description>USBPHYEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROEN</name>
							<description>STGENROEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB4ENCLRR</name>
					<displayName>RCC_MP_APB4ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit of the corresponding peripheral. It shall be used to deallocate a peripheral from MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x204</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LTDCEN</name>
							<description>LTDCEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DSIEN</name>
							<description>DSIEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DDRPERFMEN</name>
							<description>DDRPERFMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG2APBEN</name>
							<description>IWDG2APBEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBPHYEN</name>
							<description>USBPHYEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENROEN</name>
							<description>STGENROEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB5ENSETR</name>
					<displayName>RCC_MP_APB5ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit of the corresponding peripheral to . It shall be used to allocate a peripheral to the MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x208</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6EN</name>
							<description>SPI6EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4EN</name>
							<description>I2C4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6EN</name>
							<description>I2C6EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTCAPBEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC1EN</name>
							<description>TZC1EN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC2EN</name>
							<description>TZC2EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZPCEN</name>
							<description>TZPCEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG1APBEN</name>
							<description>IWDG1APBEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSECEN</name>
							<description>BSECEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENEN</name>
							<description>STGENEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_APB5ENCLRR</name>
					<displayName>RCC_MP_APB5ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit of the corresponding peripheral. It shall be used to deallocate a peripheral from MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to .</description>
					<addressOffset>0x20C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SPI6EN</name>
							<description>SPI6EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C4EN</name>
							<description>I2C4EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C6EN</name>
							<description>I2C6EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RTCAPBEN</name>
							<description>RTCAPBEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC1EN</name>
							<description>TZC1EN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZC2EN</name>
							<description>TZC2EN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TZPCEN</name>
							<description>TZPCEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IWDG1APBEN</name>
							<description>IWDG1APBEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSECEN</name>
							<description>BSECEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STGENEN</name>
							<description>STGENEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_AHB5ENSETR</name>
					<displayName>RCC_MP_AHB5ENSETR</displayName>
					<description>This register is used to set the peripheral clock enable bit of the corresponding peripheral to . It shall be used to allocate a peripheral to the MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x210</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010000</resetValue>
					<fields>
						<field>
							<name>GPIOZEN</name>
							<description>GPIOZEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1EN</name>
							<description>CRYP1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1EN</name>
							<description>HASH1EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1EN</name>
							<description>RNG1EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKPSRAMEN</name>
							<description>BKPSRAMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXIMCEN</name>
							<description>AXIMCEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_MP_AHB5ENCLRR</name>
					<displayName>RCC_MP_AHB5ENCLRR</displayName>
					<description>This register is used to clear the peripheral clock enable bit of the corresponding peripheral. It shall be used to deallocate a peripheral from MPU. Writing  has no effect, reading will return the effective values of the corresponding bits. Writing a  sets the corresponding bit to . If TZEN = , this register can only be modified in secure mode.</description>
					<addressOffset>0x214</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00010000</resetValue>
					<fields>
						<field>
							<name>GPIOZEN</name>
							<description>GPIOZEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP1EN</name>
							<description>CRYP1EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH1EN</name>
							<description>HASH1EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG1EN</name>
							<description>RNG1EN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BKPSRAMEN</name>
							<description>BKPSRAMEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AXIMCEN</name>
							<description>AXIMCEN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
