henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
				<register>
					<name>RCC_APB1RSTSETR</name>
					<displayName>RCC_APB1RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral.</description>
					<addressOffset>0x980</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIM2RST</name>
							<description>TIM2RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3RST</name>
							<description>TIM3RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4RST</name>
							<description>TIM4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM5RST</name>
							<description>TIM5RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6RST</name>
							<description>TIM6RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7RST</name>
							<description>TIM7RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM12RST</name>
							<description>TIM12RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM13RST</name>
							<description>TIM13RST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14RST</name>
							<description>TIM14RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM1RST</name>
							<description>LPTIM1RST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2RST</name>
							<description>SPI2RST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3RST</name>
							<description>SPI3RST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2RST</name>
							<description>USART2RST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3RST</name>
							<description>USART3RST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4RST</name>
							<description>UART4RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5RST</name>
							<description>UART5RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART7RST</name>
							<description>UART7RST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART8RST</name>
							<description>UART8RST</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1RST</name>
							<description>I2C1RST</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2RST</name>
							<description>I2C2RST</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C3RST</name>
							<description>I2C3RST</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C5RST</name>
							<description>I2C5RST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPDIFRST</name>
							<description>SPDIFRST</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CECRST</name>
							<description>CECRST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC12RST</name>
							<description>DAC12RST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDIOSRST</name>
							<description>MDIOSRST</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB1RSTCLRR</name>
					<displayName>RCC_APB1RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral.</description>
					<addressOffset>0x984</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIM2RST</name>
							<description>TIM2RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM3RST</name>
							<description>TIM3RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM4RST</name>
							<description>TIM4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM5RST</name>
							<description>TIM5RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6RST</name>
							<description>TIM6RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7RST</name>
							<description>TIM7RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM12RST</name>
							<description>TIM12RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM13RST</name>
							<description>TIM13RST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM14RST</name>
							<description>TIM14RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM1RST</name>
							<description>LPTIM1RST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI2RST</name>
							<description>SPI2RST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI3RST</name>
							<description>SPI3RST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART2RST</name>
							<description>USART2RST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART3RST</name>
							<description>USART3RST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART4RST</name>
							<description>UART4RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART5RST</name>
							<description>UART5RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART7RST</name>
							<description>UART7RST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UART8RST</name>
							<description>UART8RST</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1RST</name>
							<description>I2C1RST</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2RST</name>
							<description>I2C2RST</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C3RST</name>
							<description>I2C3RST</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C5RST</name>
							<description>I2C5RST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPDIFRST</name>
							<description>SPDIFRST</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CECRST</name>
							<description>CECRST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC12RST</name>
							<description>DAC12RST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDIOSRST</name>
							<description>MDIOSRST</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB2RSTSETR</name>
					<displayName>RCC_APB2RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral.</description>
					<addressOffset>0x988</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIM1RST</name>
							<description>TIM1RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM8RST</name>
							<description>TIM8RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15RST</name>
							<description>TIM15RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16RST</name>
							<description>TIM16RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17RST</name>
							<description>TIM17RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1RST</name>
							<description>SPI1RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI4RST</name>
							<description>SPI4RST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI5RST</name>
							<description>SPI5RST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART6RST</name>
							<description>USART6RST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI1RST</name>
							<description>SAI1RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI2RST</name>
							<description>SAI2RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI3RST</name>
							<description>SAI3RST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFSDMRST</name>
							<description>DFSDMRST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FDCANRST</name>
							<description>FDCANRST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB2RSTCLRR</name>
					<displayName>RCC_APB2RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral. </description>
					<addressOffset>0x98C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIM1RST</name>
							<description>TIM1RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM8RST</name>
							<description>TIM8RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM15RST</name>
							<description>TIM15RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16RST</name>
							<description>TIM16RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17RST</name>
							<description>TIM17RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI1RST</name>
							<description>SPI1RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI4RST</name>
							<description>SPI4RST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPI5RST</name>
							<description>SPI5RST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USART6RST</name>
							<description>USART6RST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI1RST</name>
							<description>SAI1RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI2RST</name>
							<description>SAI2RST</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI3RST</name>
							<description>SAI3RST</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DFSDMRST</name>
							<description>DFSDMRST</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FDCANRST</name>
							<description>FDCANRST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB3RSTSETR</name>
					<displayName>RCC_APB3RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral. </description>
					<addressOffset>0x990</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM2RST</name>
							<description>LPTIM2RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3RST</name>
							<description>LPTIM3RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4RST</name>
							<description>LPTIM4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5RST</name>
							<description>LPTIM5RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4RST</name>
							<description>SAI4RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGRST</name>
							<description>SYSCFGRST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFRST</name>
							<description>VREFRST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSRST</name>
							<description>DTSRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_APB3RSTCLRR</name>
					<displayName>RCC_APB3RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral.</description>
					<addressOffset>0x994</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LPTIM2RST</name>
							<description>LPTIM2RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM3RST</name>
							<description>LPTIM3RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM4RST</name>
							<description>LPTIM4RST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPTIM5RST</name>
							<description>LPTIM5RST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SAI4RST</name>
							<description>SAI4RST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSCFGRST</name>
							<description>SYSCFGRST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFRST</name>
							<description>VREFRST</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTSRST</name>
							<description>DTSRST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB2RSTSETR</name>
					<displayName>RCC_AHB2RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral.</description>
					<addressOffset>0x998</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA1RST</name>
							<description>DMA1RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2RST</name>
							<description>DMA2RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMUXRST</name>
							<description>DMAMUXRST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC12RST</name>
							<description>ADC12RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBORST</name>
							<description>USBORST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC3RST</name>
							<description>SDMMC3RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB2RSTCLRR</name>
					<displayName>RCC_AHB2RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral.</description>
					<addressOffset>0x99C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMA1RST</name>
							<description>DMA1RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMA2RST</name>
							<description>DMA2RST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAMUXRST</name>
							<description>DMAMUXRST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC12RST</name>
							<description>ADC12RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>USBORST</name>
							<description>USBORST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDMMC3RST</name>
							<description>SDMMC3RST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB3RSTSETR</name>
					<displayName>RCC_AHB3RSTSETR</displayName>
					<description>This register is used to activate the reset of the corresponding peripheral.</description>
					<addressOffset>0x9A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCMIRST</name>
							<description>DCMIRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP2RST</name>
							<description>CRYP2RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH2RST</name>
							<description>HASH2RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG2RST</name>
							<description>RNG2RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC2RST</name>
							<description>CRC2RST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEMRST</name>
							<description>HSEMRST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPCCRST</name>
							<description>IPCCRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCC_AHB3RSTCLRR</name>
					<displayName>RCC_AHB3RSTCLRR</displayName>
					<description>This register is used to release the reset of the corresponding peripheral.</description>
					<addressOffset>0x9A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DCMIRST</name>
							<description>DCMIRST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRYP2RST</name>
							<description>CRYP2RST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HASH2RST</name>
							<description>HASH2RST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RNG2RST</name>
							<description>RNG2RST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CRC2RST</name>
							<description>CRC2RST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HSEMRST</name>
							<description>HSEMRST</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPCCRST</name>
							<description>IPCCRST</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
