henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
				<register>
					<name>OTG_HCSPLT4</name>
					<displayName>OTG_HCSPLT4</displayName>
					<description>OTG host channel 4 split control register</description>
					<addressOffset>0x584</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PRTADDR</name>
							<description>PRTADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>HUBADDR</name>
							<description>HUBADDR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>XACTPOS</name>
							<description>XACTPOS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>COMPLSPLT</name>
							<description>COMPLSPLT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLITEN</name>
							<description>SPLITEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCINT4</name>
					<displayName>OTG_HCINT4</displayName>
					<description>This register indicates the status of a channel with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the host channels interrupt bit in the core interrupt register (HCINT bit in OTG_GINTSTS) is set. Before the application can read this register, it must first read the host all channels interrupt (OTG_HAINT) register to get the exact channel number for the host channel-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_HAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0x588</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHH</name>
							<description>CHH</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACK</name>
							<description>ACK</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXERR</name>
							<description>TXERR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BBERR</name>
							<description>BBERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FRMOR</name>
							<description>FRMOR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTERR</name>
							<description>DTERR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>XCSXACTERR</name>
							<description>XCSXACTERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DESCLSTROLL</name>
							<description>DESCLSTROLL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCINTMSK4</name>
					<displayName>OTG_HCINTMSK4</displayName>
					<description>This register reflects the mask for each channel status described in the previous section.</description>
					<addressOffset>0x58C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRCM</name>
							<description>XFRCM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHHM</name>
							<description>CHHM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERRM</name>
							<description>AHBERRM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STALLM</name>
							<description>STALLM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAKM</name>
							<description>NAKM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACKM</name>
							<description>ACKM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXERRM</name>
							<description>TXERRM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BBERRM</name>
							<description>BBERRM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FRMORM</name>
							<description>FRMORM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTERRM</name>
							<description>DTERRM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNAMSK</name>
							<description>BNAMSK</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DESCLSTROLLMSK</name>
							<description>DESCLSTROLLMSK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCTSIZ4</name>
					<displayName>OTG_HCTSIZ4</displayName>
					<description>OTG host channel 4 transfer size register</description>
					<addressOffset>0x590</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>DPID</name>
							<description>DPID</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCDMA4</name>
					<displayName>OTG_HCDMA4</displayName>
					<description>OTG host channel 4 DMA address register in buffer DMA [alternate]</description>
					<addressOffset>0x594</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCDMAB4</name>
					<displayName>OTG_HCDMAB4</displayName>
					<description>OTG host channel-n DMA address buffer register</description>
					<addressOffset>0x59C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HCDMAB</name>
							<description>HCDMAB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCCHAR5</name>
					<displayName>OTG_HCCHAR5</displayName>
					<description>OTG host channel 5 characteristics register</description>
					<addressOffset>0x5A0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>EPNUM</name>
							<description>EPNUM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EPDIR</name>
							<description>EPDIR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSDEV</name>
							<description>LSDEV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MCNT</name>
							<description>MCNT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DAD</name>
							<description>DAD</description>
							<bitOffset>22</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>CHDIS</name>
							<description>CHDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHENA</name>
							<description>CHENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCSPLT5</name>
					<displayName>OTG_HCSPLT5</displayName>
					<description>OTG host channel 5 split control register</description>
					<addressOffset>0x5A4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PRTADDR</name>
							<description>PRTADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>HUBADDR</name>
							<description>HUBADDR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>XACTPOS</name>
							<description>XACTPOS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>COMPLSPLT</name>
							<description>COMPLSPLT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLITEN</name>
							<description>SPLITEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCINT5</name>
					<displayName>OTG_HCINT5</displayName>
					<description>This register indicates the status of a channel with respect to USB- and AHB-related events. It is shown in Figure724. The application must read this register when the host channels interrupt bit in the core interrupt register (HCINT bit in OTG_GINTSTS) is set. Before the application can read this register, it must first read the host all channels interrupt (OTG_HAINT) register to get the exact channel number for the host channel-x interrupt register. The application must clear the appropriate bit in this register to clear the corresponding bits in the OTG_HAINT and OTG_GINTSTS registers.</description>
					<addressOffset>0x5A8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRC</name>
							<description>XFRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHH</name>
							<description>CHH</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERR</name>
							<description>AHBERR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STALL</name>
							<description>STALL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAK</name>
							<description>NAK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACK</name>
							<description>ACK</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXERR</name>
							<description>TXERR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BBERR</name>
							<description>BBERR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FRMOR</name>
							<description>FRMOR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTERR</name>
							<description>DTERR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNA</name>
							<description>BNA</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>XCSXACTERR</name>
							<description>XCSXACTERR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DESCLSTROLL</name>
							<description>DESCLSTROLL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCINTMSK5</name>
					<displayName>OTG_HCINTMSK5</displayName>
					<description>This register reflects the mask for each channel status described in the previous section.</description>
					<addressOffset>0x5AC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRCM</name>
							<description>XFRCM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHHM</name>
							<description>CHHM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AHBERRM</name>
							<description>AHBERRM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STALLM</name>
							<description>STALLM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NAKM</name>
							<description>NAKM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACKM</name>
							<description>ACKM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>NYET</name>
							<description>NYET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TXERRM</name>
							<description>TXERRM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BBERRM</name>
							<description>BBERRM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FRMORM</name>
							<description>FRMORM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTERRM</name>
							<description>DTERRM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BNAMSK</name>
							<description>BNAMSK</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DESCLSTROLLMSK</name>
							<description>DESCLSTROLLMSK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCTSIZ5</name>
					<displayName>OTG_HCTSIZ5</displayName>
					<description>OTG host channel 5 transfer size register</description>
					<addressOffset>0x5B0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>XFRSIZ</name>
							<description>XFRSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>19</bitWidth>
						</field>
						<field>
							<name>PKTCNT</name>
							<description>PKTCNT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
						<field>
							<name>DPID</name>
							<description>DPID</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCDMA5</name>
					<displayName>OTG_HCDMA5</displayName>
					<description>OTG host channel 5 DMA address register in buffer DMA [alternate]</description>
					<addressOffset>0x5B4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DMAADDR</name>
							<description>DMAADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCDMAB5</name>
					<displayName>OTG_HCDMAB5</displayName>
					<description>OTG host channel-n DMA address buffer register</description>
					<addressOffset>0x5BC</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>HCDMAB</name>
							<description>HCDMAB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCCHAR6</name>
					<displayName>OTG_HCCHAR6</displayName>
					<description>OTG host channel 6 characteristics register</description>
					<addressOffset>0x5C0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MPSIZ</name>
							<description>MPSIZ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>EPNUM</name>
							<description>EPNUM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EPDIR</name>
							<description>EPDIR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LSDEV</name>
							<description>LSDEV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EPTYP</name>
							<description>EPTYP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MCNT</name>
							<description>MCNT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DAD</name>
							<description>DAD</description>
							<bitOffset>22</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>CHDIS</name>
							<description>CHDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHENA</name>
							<description>CHENA</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OTG_HCSPLT6</name>
					<displayName>OTG_HCSPLT6</displayName>
					<description>OTG host channel 6 split control register</description>
					<addressOffset>0x5C4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PRTADDR</name>
							<description>PRTADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>HUBADDR</name>
							<description>HUBADDR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>XACTPOS</name>
							<description>XACTPOS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>COMPLSPLT</name>
							<description>COMPLSPLT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPLITEN</name>
							<description>SPLITEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
