henri-32/esp32-tiller-autopilot/.pio-core/platforms/ststm32/misc/svd/STM32MP157x.svd
        <register>
          <name>AXIMC_M8_FN_MOD</name>
          <displayName>AXIMC_M8_FN_MOD</displayName>
          <description>AXIMC master 8 issuing capability override functionality register</description>
          <addressOffset>0x60E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
		 <register>
          <name>AXIMC_M4_FN_MOD2</name>
          <displayName>AXIMC_M4_FN_MOD2</displayName>
          <description>AXIMC master 4 packing functionality register</description>
          <addressOffset>0x8000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_READ_QOS</name>
          <displayName>AXIMC_M4_READ_QOS</displayName>
          <description>AXIMC master 4 read priority register</description>
          <addressOffset>0x80DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_WRITE_QOS</name>
          <displayName>AXIMC_M4_WRITE_QOS</displayName>
          <description>AXIMC master 4 write priority register</description>
          <addressOffset>0x80E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M4_FN_MOD</name>
          <displayName>AXIMC_M4_FN_MOD</displayName>
          <description>AXIMC master 4 packing functionality register</description>
          <addressOffset>0x80E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M9_READ_QOS</name>
          <displayName>AXIMC_M9_READ_QOS</displayName>
          <description>AXIMC master 9 read priority register</description>
          <addressOffset>0x90DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M9_WRITE_QOS</name>
          <displayName>AXIMC_M9_WRITE_QOS</displayName>
          <description>AXIMC master 9 write priority register</description>
          <addressOffset>0x90E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M9_FN_MOD</name>
          <displayName>AXIMC_M9_FN_MOD</displayName>
          <description>AXIMC master 9 issuing capability override functionality register</description>
          <addressOffset>0x90E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M10_READ_QOS</name>
          <displayName>AXIMC_M10_READ_QOS</displayName>
          <description>AXIMC master 10 read priority register</description>
          <addressOffset>0xA0DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M10_WRITE_QOS</name>
          <displayName>AXIMC_M10_WRITE_QOS</displayName>
          <description>AXIMC master 10 write priority register</description>
          <addressOffset>0xA0E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M10_FN_MOD</name>
          <displayName>AXIMC_M10_FN_MOD</displayName>
          <description>AXIMC master 10 issuing capability override functionality register</description>
          <addressOffset>0xA0E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M6_FN_MOD2</name>
          <displayName>AXIMC_M6_FN_MOD2</displayName>
          <description>AXIMC master 6 packing functionality register</description>
          <addressOffset>0xB000</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYPASS_MERGE</name>
              <description>BYPASS_MERGE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M6_READ_QOS</name>
          <displayName>AXIMC_M6_READ_QOS</displayName>
          <description>AXIMC master 6 read priority register</description>
          <addressOffset>0xB0DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AR_QOS</name>
              <description>AR_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M6_WRITE_QOS</name>
          <displayName>AXIMC_M6_WRITE_QOS</displayName>
          <description>AXIMC master 6 write priority register</description>
          <addressOffset>0xB0E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AW_QOS</name>
              <description>AW_QOS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M6_FN_MOD</name>
          <displayName>AXIMC_M6_FN_MOD</displayName>
          <description>AXIMC master 6 issuing capability override functionality register</description>
          <addressOffset>0xB0E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ_ISS_OVERRIDE</name>
              <description>READ_ISS_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_ISS_OVERRIDE</name>
              <description>WRITE_ISS_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
		 <register>
          <name>AXIMC_PERIPH_ID_4</name>
          <displayName>AXIMC_PERIPH_ID_4</displayName>
          <description>AXIMC peripheral ID4 register</description>
          <addressOffset>0x1FD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>JEP106CON</name>
              <description>JEP106CON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>K4COUNT</name>
              <description>K4COUNT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_5</name>
          <displayName>AXIMC_PERIPH_ID_5</displayName>
          <description>AXIMC peripheral ID5 register</description>
          <addressOffset>0x1FD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_5</name>
              <description>PERIPH_ID_5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_6</name>
          <displayName>AXIMC_PERIPH_ID_6</displayName>
          <description>AXIMC peripheral ID6 register</description>
          <addressOffset>0x1FD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_6</name>
              <description>PERIPH_ID_6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_7</name>
          <displayName>AXIMC_PERIPH_ID_7</displayName>
          <description>AXIMC peripheral ID7 register</description>
          <addressOffset>0x1FDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_7</name>
              <description>PERIPH_ID_7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_0</name>
          <displayName>AXIMC_PERIPH_ID_0</displayName>
          <description>AXIMC peripheral ID0 register</description>
          <addressOffset>0x1FE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_0</name>
              <description>PERIPH_ID_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_1</name>
          <displayName>AXIMC_PERIPH_ID_1</displayName>
          <description>AXIMC peripheral ID1 register</description>
          <addressOffset>0x1FE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_1</name>
              <description>PERIPH_ID_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_2</name>
          <displayName>AXIMC_PERIPH_ID_2</displayName>
          <description>AXIMC peripheral ID2 register</description>
          <addressOffset>0x1FE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000003B</resetValue>
          <fields>
            <field>
              <name>PERIPH_ID_2</name>
              <description>PERIPH_ID_2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_PERIPH_ID_3</name>
          <displayName>AXIMC_PERIPH_ID_3</displayName>
          <description>AXIMC peripheral ID3 register</description>
          <addressOffset>0x1FEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CUST_MOD_NUM</name>
              <description>CUST_MOD_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REV_AND</name>
              <description>REV_AND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_COMP_ID_0</name>
          <displayName>AXIMC_COMP_ID_0</displayName>
          <description>AXIMC component ID0 register</description>
          <addressOffset>0x1FF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>PREAMBLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_COMP_ID_1</name>
          <displayName>AXIMC_COMP_ID_1</displayName>
          <description>AXIMC component ID1 register</description>
          <addressOffset>0x1FF4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000F0</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>PREAMBLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLASS</name>
              <description>CLASS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_COMP_ID_2</name>
          <displayName>AXIMC_COMP_ID_2</displayName>
          <description>AXIMC component ID2 register</description>
          <addressOffset>0x1FF8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>PREAMBLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_COMP_ID_3</name>
          <displayName>AXIMC_COMP_ID_3</displayName>
          <description>AXIMC component ID3 register</description>
          <addressOffset>0x1FFC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>PREAMBLE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
		 <register>
          <name>AXIMC_M0_FN_MOD_AHB</name>
          <displayName>AXIMC_M0_FN_MOD_AHB</displayName>
          <description>AXIMC master 0 AHB conversion override functionality register</description>
          <addressOffset>0x42028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>RD_INC_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>WR_INC_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M1_FN_MOD_AHB</name>
          <displayName>AXIMC_M1_FN_MOD_AHB</displayName>
          <description>AXIMC master 1 AHB conversion override functionality register</description>
          <addressOffset>0x43028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>RD_INC_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>WR_INC_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M2_FN_MOD_AHB</name>
          <displayName>AXIMC_M2_FN_MOD_AHB</displayName>
          <description>AXIMC master 2 AHB conversion override functionality register</description>
          <addressOffset>0x44028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>RD_INC_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>WR_INC_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXIMC_M5_FN_MOD_AHB</name>
          <displayName>AXIMC_M5_FN_MOD_AHB</displayName>
          <description>AXIMC master 5 AHB conversion override functionality register</description>
          <addressOffset>0x45028</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RD_INC_OVERRIDE</name>
              <description>RD_INC_OVERRIDE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_INC_OVERRIDE</name>
              <description>WR_INC_OVERRIDE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
